export const state = () => ({
  posts: [
    {
      message_id: 829061,
      text: 'Бескассовые магазины Amazon Go обвинили в нарушениях правил города Нью-Йорк об информирования покупателей о сборе биометрических идентификаторов.\r\n\r\nСоответствующий закон приняли в 2021 году. Согласно документу, учреждения, записывающие биометрические данные посетителей, должны разместить информационные таблички на видном месте.\r\n\r\nВ коллективном иске к техгиганту указано, что в магазине Amazon Go на Пайн-стрит не было заметной вывески в соответствии с законом. Заявитель Родригес Перс утверждает, что 7 февраля 2023 года отправил письмо в компанию и отметил отсутствие информирования.',
      cover_img_id: null,
      header:
        'Amazon Go обвинили (https://forklog.com/news/ai/amazon-go-obvinili-v-nezakonnoj-biometricheskoj-slezhke) в незаконной биометрической слежке',
      date: '2023-03-17T22:14:41',
      views: 203,
      channel: {
        channel_id: -1001479224822,
        username: 'evtublog',
        photo_id: '8e9c3b40-74ec-4da8-4b70-b84f84c66000',
        cover_img_id: null,
        about: 'Создаю первую метавселенную в дополненной реальности @trace_ru',
        title: 'Bogdan Evtushenko',
        subscribers: 0,
        date: '2023-03-17'
      }
    },
    {
      message_id: 829063,
      text: 'DoraHacks, крупнейшая хакерская платформа в мире и партнёр The Open Network, опубликовала обзор  (https://dorahacks.io/blog/news/highlights-revealed-hack-a-tonx/)14 живых событий (https://dorahacks.io/blog/news/highlights-revealed-hack-a-tonx/), проходивших по всему миру в рамках глобального хакатона Hack-a-TON x DoraHacks с призовым фондом в $300 000.\r\n\r\nРанее мы публиковали собственные отчёты об этих событиях (Часть 1 (https://t.me/toncoin_rus/710) и часть 2 (https://t.me/toncoin_rus/733)), однако если вы хотите узнать больше о состоявшихся офлайн-сессиях и принять участие в следующем хакатоне, рекомендуем изучить опубликованный материал (https://dorahacks.io/blog/news/highlights-revealed-hack-a-tonx/)',
      cover_img_id: null,
      header: 'Обзор живых встреч Hack-a-TON x DoraHacks.',
      date: '2023-03-17T22:18:00',
      views: 9625,
      channel: {
        channel_id: -1001579620324,
        username: 'toncoin_rus',
        photo_id: 'fbdbe8f7-6caa-4c8b-a89c-aec3691ce700',
        cover_img_id: null,
        about:
          'TON – это блокчейн, спроектированный Telegram и поддерживаемый открытым сообществом. В TON доступны сверхбыстрые транзакции, низкие комиссии и удобные приложения, некоторые из которых можно найти непосредственно в Telegram: @wallet или @cryptobot. ton.org',
        title: 'TON Community RUS',
        subscribers: 330697,
        date: '2023-03-17'
      }
    },
    {
      message_id: 829065,
      text: "Если говорить совсем откровенно, а я всё-таки хочу, чтобы ты видел в первую очередь меня, как человека, а не как сигналы по входу в сделку на Bybit'e, то личная жизнь также испытывает проверку на прочность. \r\n\r\nОтношения в браке не такие безоблачные, как хотелось бы и бытовые вопросы накапливают претензии, которые не всегда решаются без проблем. \r\n\r\nВ общем и целом, из-за того, что всё навалилось разом, честно сказать, опускаются руки. Работу и посты я делаю сейчас больше на автомате, чтобы не подвести других ребят.\r\n\r\nНедавно вспомнил, как одна знакомая спросила, чего я боюсь больше всего, я сказал, что остаться одному. Возможно ли это? Не знаю. Хуже ведь уже не будет? Наверное",
      cover_img_id: null,
      header: 'Страх, который я начал вспоминать',
      date: '2023-03-17T22:23:44',
      views: 1860,
      channel: {
        channel_id: -1001387303841,
        username: 'gusevself',
        photo_id: 'a7f9e7bd-db21-457c-5a12-a199d236a000',
        cover_img_id: null,
        about:
          '⚡️ В крипте с 2016 и TON с 2021  🔥 Трейдер: анализ рынка, инсайды  💻 Строю бизнес, пишу про развитие   Реклама @CryptoGusev   English @gusevlife  Бот @TegroTONbot   https://youtube.com/@GUSEVLIVE  https://vk.com/btc.bitcoin  https://twitter.com/gusevlife',
        title: 'Святослав Гусев',
        subscribers: 34201,
        date: '2023-03-17'
      }
    },
    {
      message_id: 829068,
      text: '🔥 Продолжаем знакомство со спикерами II KAZAN CRYPTOFORUM.\r\n\r\n🟡 Наш генеральный партнер, сооснователь одной из крупнейших и профессиональных команд в РФ «Banana Crypto», Динар Фасхутдинов. \r\n\r\nДа, тот самый парень, который купил Lamborghini в 23 года. 😜\r\n\r\nТе, кто был на FIRST KAZAN CRYPTOFORUM, точно помнят его выступление! Дайте знать своими реакциями. 👇 \r\n\r\n💰 Динар в 2017 году первый раз купил биткоин, с 2018 полностью работает в криптосфере. Он профессионал своего дела, закончил КФУ по направлению «Информационная Безопасность». \r\n\r\n📱 Вы уже подписаны на самое честное и полезное сообщество «Banana Crypto» (https://t.me/bananacrpt) ? \r\nТам и опытные, и начинающие криптоэнтузиасты найдут то, что нужно — это сообщество энтузиастов, охватывающее основные направления в крипте. \r\n📺 Также не можем не порекомендовать вам YouTube-канал «Banana Crypto» (https://www.youtube.com/@banana_crypto) — концентрация полезного контента!\r\n\r\nО чем Динар будет говорить на форуме? Расскажем чуть позже. \r\n\r\n❓ А о чем хотели бы послушать вы? Пишите в комментариях. 👇\r\n\r\n👉 Приобрести билет на II KAZAN CRYPTOFORUM вы можете на официальном сайте. (https://forum2023.crypto-polygon.ru/)\r\n\r\n😍  CRYPTOFORUM — событие, которое ты ждал',
      cover_img_id: null,
      header: '🔥 Продолжаем знакомство со спикерами II KAZAN CRYPTOFORUM.',
      date: '2023-03-17T22:28:27',
      views: 168,
      channel: {
        channel_id: -1001796138587,
        username: 'crypto_polygon',
        photo_id: 'a1d1ba84-9996-4689-97f0-10a27f028500',
        cover_img_id: null,
        about:
          'Центр интеграции государства и криптоиндустрии   Администратор - @crypto_polygon_admin   Наш чат - https://t.me/+BWxnCVpxp7hhZmYy',
        title: 'Криптополигон',
        subscribers: 1240,
        date: '2023-03-17'
      }
    },
    {
      message_id: 212,
      text: '📈 Цена биткоина протестировала (https://forklog.com/news/tsena-bitkoina-preodolela-uroven-27-000) уровень $27 000\r\n\r\n⚖️ Против YouTube-инфлюенсеров подали (https://forklog.com/news/protiv-youtube-inflyuenserov-podali-isk-za-prodvizhenie-ftx) иск за продвижение FTX. Менеджмент платформы отчитался, что экс-руководители получил (https://forklog.com/news/sem-benkman-frid-poluchil-2-2-mlrd-ot-ftx-i-alameda-research) $2,2 млрд от FTX и Alameda Research\r\n\r\n🔍 Связанный со взломом Euler Finance кошелек отправил (https://forklog.com/news/svyazannyj-so-vzlomom-euler-finance-koshelek-otpravil-100-eth-na-adres-lazarus-group) 100 ETH на адрес Lazarus Group\r\n\r\n📈 CEO Messari предсказал (https://forklog.com/news/ceo-messari-predskazal-rost-bitkoina-do-100-000) рост биткоина до $100 000\r\n\r\n🐕 NFT-сообщество разыграет (https://forklog.com/news/nft-soobshhestvo-razygraet-poezdku-v-yaponiyu-dlya-vstrechi-s-simvolom-dogecoin) поездку в Японию для встречи с символом Dogecoin\r\n\r\n💬 Глава BlackRock указал (https://forklog.com/news/glava-blackrock-ukazal-na-plyusy-tokenizatsii-dlya-rynkov-kapitala) на плюсы токенизации для рынков капитала\r\n\r\n⛔️ 21Shares откажется (https://forklog.com/news/21shares-otkazhetsya-ot-shesti-kripto-etp-iz-za-nizkogo-sprosa) от шести крипто-ETP из-за низкого спроса\r\n\r\n💸 Playboy отразил (https://forklog.com/news/playboy-otrazil-ubytok-v-4-9-mln-po-poluchennym-za-nft-kollektsiyu-ethereum) убыток в $4,9 млн по полученным за NFT-коллекцию Ethereum\r\n\r\n⚖️ SVB Financial Group подала (https://forklog.com/news/svb-financial-group-podala-zayavlenie-o-bankrotstve) заявление о банкротстве\r\n\r\n💰 Команда Flare начала распределять (https://forklog.com/news/komanda-flare-nachala-raspredelyat-tokeny-flr-na-summu-714-mln) токены FLR на сумму $714 млн\r\n\r\n📊 Трейдер назвал (https://forklog.com/news/trejder-nazval-usloviya-dlya-rosta-tseny-bitkoina) условия для роста цены биткоина\r\n\r\n#дайджест',
      cover_img_id: 'caaa80b1-4dae-4c2e-84a6-2fc94f17c300',
      header: '📈 Цена биткоина протестировала уровень $27 000',
      date: '2023-03-17T22:34:26',
      views: 7422,
      channel: {
        channel_id: -1001000499465,
        username: 'forklog',
        photo_id: '41396831-311b-42dd-9ad6-0fa88a910a00',
        cover_img_id: null,
        about:
          'Официальный канал культового журнала ForkLog. Все самое главное о криптовалютах и децентрализованных технологиях. @forklogfeed — все новости подряд.  Реклама на ForkLog: https://forklog.com/advertisement/ Сообщество в Discord - http://discord.gg/forklog',
        title: 'ForkLog',
        subscribers: 98473,
        date: '2023-03-17'
      }
    },
    {
      message_id: 123,
      text: 'Binance запускает 30-й проект на Binance Launchpad — Space ID (ID) . Продажа токенов для Space ID будет проходить в формате подписки на Launchpad с записью балансов пользователей BNB, начиная с 17 марта 2023 г., 00:00 (UTC). Подробности тут! (https://www.binance.com/en/support/announcement/introducing-the-space-id-id-token-sale-on-binance-launchpad-81e9da9067c847dfa3afd959e521c32a)👈\r\n\r\nРасчетный период владения BNB\r\n2023-03-17 03:00 (мск)\r\nПериод подписки\r\n2023-03-22 09:00 (мск)\r\nРасчетный период\r\n2023-03-22 12:00  (мск)\r\nОкончательное распределение токенов\r\n22.03.2023 11:00\r\n\r\nБеларусь в бане😆\r\n\r\nBinance регистрация (https://accounts.binance.com/ru/register?ref=ZGUBWILD) со скидкой 20% на комиссии',
      cover_img_id: 'e82427ee-e294-4bb1-4cf8-aa0185f2f400',
      header: 'Binance Launchpad - Space ID (ID)',
      date: '2023-03-17T22:12:35',
      views: 405,
      channel: {
        channel_id: -1001490737979,
        username: 'cryptohodlnew',
        photo_id: '0db2fe8a-50af-4807-f828-47a318fc4d00',
        cover_img_id: null,
        about:
          'В крипте с 2017 года! Здесь мы публикуем актуальные новости и торговые решения!  Чат - https://t.me/Cryptohodlchat YouTube - https://youtube.com/channel/UCNiMta4AL2lwHg3yIz87xMw  По вопросам сотрудничества - @den3master',
        title: 'Cryptohodl News',
        subscribers: 2365,
        date: '2022-02-01'
      }
    }
  ]
})

export const getters = {
  getPosts(state: any) {
    return state.posts
  }
}

export const mutations = {
  setPosts(state: any, data: any) {
    state.topics = data
  }
}

export const actions = {}
